{
  "type": "composer",
  "fullName": "Hanns Eisler",
  "birthYear": 1898,
  "deathYear": 1962,
  "nationality": "Austrian-German",
  "biography": {
    "es": "Compositor austriaco-alemán, discípulo de Schoenberg. Colaborador de Bertolt Brecht, creó el himno de la RDA y música revolucionaria antifascista.",
    "en": "Austrian-German composer, student of Schoenberg. Collaborator of Bertolt Brecht, created the GDR anthem and revolutionary anti-fascist music.",
    "de": "Österreichisch-deutscher Komponist, Schüler Schönbergs. Mitarbeiter Bertolt Brechts, schuf die DDR-Hymne und revolutionäre antifaschistische Musik."
  },
  "works": [
    "Einheitsfrontlied",
    "Auferstanden aus Ruinen",
    "Der heimliche Aufmarsch"
  ],
  "politicalContext": {
    "es": "Frente antifascista alemán, exilio durante el nazismo, República Democrática Alemana",
    "en": "German anti-fascist front, exile during Nazism, German Democratic Republic",
    "de": "Deutsche antifaschistische Front, Exil während des Nationalsozialismus, Deutsche Demokratische Republik"
  },
  "collaborators": [
    "Bertolt Brecht",
    "Ernst Busch"
  ],
  "sources": [
    "Hanns-Eisler-Archiv",
    "Akademie der Künste Berlin",
    "DEFA-Stiftung"
  ],
  "relatedSongs": [
    {
      "title": "Der Heimliche Aufmarsch",
      "year": 1929,
      "day": 6
    },
    {
      "title": "Einheitsfrontlied",
      "year": 1934,
      "day": 11
    }
  ],
  "connections": [
    {
      "artist1": "Hanns Eisler",
      "artist2": "Bertolt Brecht",
      "relationship": "collaborator",
      "description": {
        "es": "Colaboración estrecha en teatro político y canciones revolucionarias",
        "en": "Close collaboration in political theater and revolutionary songs",
        "de": "Enge Zusammenarbeit im politischen Theater und in revolutionären Liedern"
      }
    },
    {
      "artist1": "Ernst Busch",
      "artist2": "Hanns Eisler",
      "relationship": "interpreter_composer",
      "description": {
        "es": "Busch fue el principal intérprete de las composiciones de Eisler",
        "en": "Busch was the main performer of Eisler's compositions",
        "de": "Busch war der Hauptinterpret von Eislers Kompositionen"
      }
    }
  ]
}